In [2]:
import numpy as np
import pandas as pd

In [3]:
city_series = pd.Series(["Tokyo", "Los Angeles", "London"], name="City")
print(f"Pandas Series:\n{city_series}\n")

Pandas Series:
0          Tokyo
1    Los Angeles
2         London
Name: City, dtype: object

In [4]:
data = {
    "City": ["Tokyo", "Los Angeles", "London"],
    "Latitude": [35.6895, 34.0522, 51.5074],
    "Longitude": [139.6917, -118.2437, -0.1278],
}
df = pd.DataFrame(data)
print(f"Pandas DataFrame:\n{df}")

Pandas DataFrame:
          City  Latitude  Longitude
0        Tokyo   35.6895   139.6917
1  Los Angeles   34.0522  -118.2437
2       London   51.5074    -0.1278

In [5]:
df

          City  Latitude  Longitude
0        Tokyo   35.6895   139.6917
1  Los Angeles   34.0522  -118.2437
2       London   51.5074    -0.1278

In [6]:
latitudes=df["Latitude"]
print(f"Latitudes:\n{latitudes}\n")
longitudes=df["Longitude"]
print(f"Longitudes:\n{longitudes}\n")

Latitudes:
0    35.6895
1    34.0522
2    51.5074
Name: Latitude, dtype: float64

Longitudes:
0    139.6917
1   -118.2437
2     -0.1278
Name: Longitude, dtype: float64

In [7]:
df_filtered= df[df["Longitude"]<0]
df_filtered

          City  Latitude  Longitude
1  Los Angeles   34.0522  -118.2437
2       London   51.5074    -0.1278

In [8]:
df["lat_radians"] = np.radians(df["Latitude"])
df["lon_radians"] = np.radians(df["Longitude"])
df

          City  Latitude  Longitude  lat_radians  lon_radians
0        Tokyo   35.6895   139.6917     0.622899     2.438080
1  Los Angeles   34.0522  -118.2437     0.594323    -2.063742
2       London   51.5074    -0.1278     0.898974    -0.002231

In [9]:
df["lat_radians"] = np.radians(df["Latitude"])+5

In [10]:
# Column doesn't exist, so this will add a new column
# Columns exist, so this will overwrite the existing column
df

          City  Latitude  Longitude  lat_radians  lon_radians
0        Tokyo   35.6895   139.6917     5.622899     2.438080
1  Los Angeles   34.0522  -118.2437     5.594323    -2.063742
2       London   51.5074    -0.1278     5.898974    -0.002231

In [11]:
# Creating a DataFrame
data = {
    "City": ["Tokyo", "Los Angeles", "London", "Paris", "Chicago"],
    "Country": ["Japan", "USA", "UK", "France", "USA"],
    "Population": [37400068, 3970000, 9126366, 2140526, 2665000],
}
df = pd.DataFrame(data)
df

          City Country  Population
0        Tokyo   Japan    37400068
1  Los Angeles     USA     3970000
2       London      UK     9126366
3        Paris  France     2140526
4      Chicago     USA     2665000

In [12]:
# grouping and summary in R (aggregation and grouping)
df_grouped= df.groupby("Country")["Population"].sum().reset_index()
df_grouped

  Country  Population
0  France     2140526
1   Japan    37400068
2      UK     9126366
3     USA     6635000

In [13]:
df1 = pd.DataFrame(
    {"City": ["Tokyo", "Los Angeles", "London"], "Country": ["Japan", "USA", "UK"]}
)
df2 = pd.DataFrame(
    {
        "City": ["Tokyo", "Los Angeles", "London"],
        "Population": [37400068, 3970000, 9126366],
    }
)

In [14]:
df1

          City Country
0        Tokyo   Japan
1  Los Angeles     USA
2       London      UK

In [15]:
df2

          City  Population
0        Tokyo    37400068
1  Los Angeles     3970000
2       London     9126366

In [16]:
df_merged = pd.merge(df1, df2, on="City")
df_merged

          City Country  Population
0        Tokyo   Japan    37400068
1  Los Angeles     USA     3970000
2       London      UK     9126366